app/controllers/cars_controller.rb

INSERT INTO "cars" ("model", "license_no", "style", "location", "manufacturer", "status", "hourly_rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

UPDATE "cars" SET "model" = ?, "license_no" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["model", "Camry"], ["license_no", "FAW 8964"], ["updated_at", "2017-09-24 20:10:37.051022"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)