app/controllers/reservations_controller.rb

  def index
    @all_reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def create
    if current_user.customer_role? and current_user.has_reservation

      @car = Car.find(@@car_id)
      @car.available?
      # stub end
      redirect_to reservations_url, notice: 'You already have an active reservation!'
    else
      @reservation = Reservation.new(reservation_params)
      @reservation.license_no = @@license_no
      @reservation.email = current_user.email
      @reservation.status = "Reserved"
      @reservation.car_id = @@car_id
      @car = Car.find(@@car_id)

      respond_to do |format|
        if @reservation.save
          @car.update(:status => "Reserved")
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-09-24 23:57:07.293585"], ["updated_at", "2017-09-24 23:57:07.293585"]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "unavailable"], ["updated_at", "2017-09-26 01:48:20.894392"], ["id", 1]]

  def destroy
    # Update car status
    @@car_id = params[:car_id]
    puts params[:car_id]
    @car = Car.find(@@car_id)

    if not current_user.customer_role?
      @reservation.destroy
---
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 1]]