app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # print @user.email

    @user.password = Digest::MD5.hexdigest(@user.password)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "CHINMAY"], ["email", "cmanjun@ncsu.edu"], ["password", "test"], ["created_at", "2017-09-24 17:45:55.334063"], ["updated_at", "2017-09-24 17:45:55.334063"]]